In [ ]:
Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [39]:
import pandas as pd

data = [4, 8, 15, 16, 23, 42]
ds = pd.Series(data)
ds

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [ ]:
-----------------------------------------------------------------------------------------------------------------------------------

In [ ]:
Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the variable print it.

In [40]:
l = [1,2,3,4,5,6,7,8,9,10]
ds = pd.Series(l)
ds

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [ ]:
-----------------------------------------------------------------------------------------------------------------------------------

In [ ]:
Q3. Create a Pandas DataFrame that contains the following data:
    
    Name       Age         Gender
    Alice      25         Female
    Bob        30         Male
    Claire     27         Female
    
Then, print the DataFrame.

In [41]:
df = pd.DataFrame({'Name' : ['Alice' , 'Bob' , 'Claire'],
                    'Age' : [25,30,27],
                    'Gender' : ['Female','Male','Female']})
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [ ]:
-----------------------------------------------------------------------------------------------------------------------------------

In [ ]:
Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

In [ ]:
DataFrame :
           It is a 2-dimensional labeled data structure that can hold data of different types (e.g., numerical, string, boolean) 
           in columns. It is similar to a table or a spreadsheet where each column represents a different variable,
           and each row represents a different observation or record.

Series :
        It  is a one-dimensional labeled array that can hold data of any type. It also show the index of the data.

In [42]:
df = pd.DataFrame({'a' : [2,3,4],
                    'b' : [25,30,27],
                    'c' : [34,56,7]})
df

   a   b   c
0  2  25  34
1  3  30  56
2  4  27   7

In [43]:
type(df)

pandas.core.frame.DataFrame

In [44]:
ds = df['a']
ds

0    2
1    3
2    4
Name: a, dtype: int64

In [45]:
type(ds)

pandas.core.series.Series

In [ ]:
-----------------------------------------------------------------------------------------------------------------------------------

In [ ]:
Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? 
    Can you give an example of when you might use one of these functions?

In [46]:
df = pd.DataFrame({'a' : [2,3,4,5,67,8,90,9,],
                    'b' : [25,30,27,2,3,4,5,6],
                    'c' : [34,56,7,1,2,3,4,5]})
df

    a   b   c
0   2  25  34
1   3  30  56
2   4  27   7
3   5   2   1
4  67   3   2
5   8   4   3
6  90   5   4
7   9   6   5

In [47]:
# head() default give first five row data
df.head()

    a   b   c
0   2  25  34
1   3  30  56
2   4  27   7
3   5   2   1
4  67   3   2

In [48]:
# tail() default give last five row data
df.tail()

    a  b  c
3   5  2  1
4  67  3  2
5   8  4  3
6  90  5  4
7   9  6  5

In [49]:
# info(): Provides a summary of the DataFrame, including the data types, number of non-null values, and memory usage.
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a       8 non-null      int64
 1   b       8 non-null      int64
 2   c       8 non-null      int64
dtypes: int64(3)
memory usage: 320.0 bytes

In [50]:
# describe(): Generates descriptive statistics of the DataFrame.
df.describe()

               a          b          c
count   8.000000   8.000000   8.000000
mean   23.500000  12.750000  14.000000
std    34.579102  12.209481  20.099751
min     2.000000   2.000000   1.000000
25%     3.750000   3.750000   2.750000
50%     6.500000   5.500000   4.500000
75%    23.500000  25.500000  13.750000
max    90.000000  30.000000  56.000000

In [51]:
# shape: Returns the dimensions (number of rows and columns) of the DataFrame.
df.shape

(8, 3)

In [52]:
#value_counts(): Returns the frequency count of unique values in a column.
df['a'].value_counts()

2     1
3     1
4     1
5     1
67    1
8     1
90    1
9     1
Name: a, dtype: int64

In [53]:
# sort_values(): Sorts the DataFrame by one or more columns. It is helpful for ordering the data based on specific criteria.
df.sort_values('a')

    a   b   c
0   2  25  34
1   3  30  56
2   4  27   7
3   5   2   1
5   8   4   3
7   9   6   5
4  67   3   2
6  90   5   4

In [ ]:
-----------------------------------------------------------------------------------------------------------------------------------

In [ ]:
Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

In [ ]:
DataFrame is mutable and Series and Panel are immutable.

In [ ]:
-----------------------------------------------------------------------------------------------------------------------------------

In [ ]:
Q7. Create a DataFrame using multiple Series. Explain with an example.

In [54]:
# the data are in series of name, age and gender then it is convertyed to dataframe using pandas.DataFrame function

name = pd.Series(['Alice' , 'Bob' , 'Claire'])
age  = pd.Series([25,30,27])
gender = pd.Series(['Female','Male','Female'])

df = pd.DataFrame({'Name' : name , 'Age' : age , 'Gender' : gender})
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female